
//ПОДОжди
//мы ещё не готовы делать файловую сисетму
//1. допилить оболочку // Ну вот тут то мне и нужна графика
//графику можно хранить в оперативной памяти, а не на жёстком диске, потому что это задействует много IO операций, которые могут быть медленными
//Ладно обойдусь без картинок пока что
//2. сделать поддержку плавающих чисел
//3. починить ATA драйвер, чтобы можно было записывать данные на жёсткий диск
//4. затем можно что-то делать с файловыми системами
//ФС нужна в графике, что бы парсить картинки png


//const char *__path_system_libraries = "/Libraries"